package main

import(
	"fmt"
)

func main () {
	
}

//==============================================================================================================

/* 
В Go есть четыре категории типов данных:

    базовые типы — числа, строки и логические значения;
    агрегатные типы — массивы и структуры;
    ссылочные типы — указатели, срезы, карты, функции и каналы;
    интерфейсные типы — интерфейсы.
*/

//==============================================================================================================

/*
!- отрицание
:= создание новой переменной и присваивание ей значение
= обьявление переменной 
== приравнивание
const - переменной присваивается неизменное значение
*/